stm32duino/Arduino_Core_STM32/boards.txt
# Generic F100C6Tx
GenF1.menu.pnum.GENERIC_F100C6TX=Generic F100C6Tx
GenF1.menu.pnum.GENERIC_F100C6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F100C6TX.upload.maximum_data_size=4096
GenF1.menu.pnum.GENERIC_F100C6TX.build.board=GENERIC_F100C6TX
GenF1.menu.pnum.GENERIC_F100C6TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C6TX.build.variant=STM32F1xx/F100C(4-6)T

# Generic F100C8Tx
GenF1.menu.pnum.GENERIC_F100C8TX=Generic F100C8Tx
GenF1.menu.pnum.GENERIC_F100C8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100C8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100C8TX.build.board=GENERIC_F100C8TX
GenF1.menu.pnum.GENERIC_F100C8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100C8TX.build.variant=STM32F1xx/F100C(8-B)T

# Generic F100CBTx
GenF1.menu.pnum.GENERIC_F100CBTX=Generic F100CBTx
GenF1.menu.pnum.GENERIC_F100CBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100CBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100CBTX.build.board=GENERIC_F100CBTX
GenF1.menu.pnum.GENERIC_F100CBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100CBTX.build.variant=STM32F1xx/F100C(8-B)T

# Generic F100R8Tx
GenF1.menu.pnum.GENERIC_F100R8TX=Generic F100R8Tx
GenF1.menu.pnum.GENERIC_F100R8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F100R8TX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100R8TX.build.board=GENERIC_F100R8TX
GenF1.menu.pnum.GENERIC_F100R8TX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100R8TX.build.variant=STM32F1xx/F100R(8-B)T

# Generic F100RBTx
GenF1.menu.pnum.GENERIC_F100RBTX=Generic F100RBTx
GenF1.menu.pnum.GENERIC_F100RBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F100RBTX.upload.maximum_data_size=8192
GenF1.menu.pnum.GENERIC_F100RBTX.build.board=GENERIC_F100RBTX
GenF1.menu.pnum.GENERIC_F100RBTX.build.product_line=STM32F100xB
GenF1.menu.pnum.GENERIC_F100RBTX.build.variant=STM32F1xx/F100R(8-B)T

# Generic F103C4Tx
GenF1.menu.pnum.GENERIC_F103C4TX=Generic F103C4Tx
GenF1.menu.pnum.GENERIC_F103C4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F103C4TX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F103C4TX.build.board=GENERIC_F103C4TX
GenF1.menu.pnum.GENERIC_F103C4TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C4TX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)

# Generic F103C6Tx
GenF1.menu.pnum.GENERIC_F103C6TX=Generic F103C6Tx
GenF1.menu.pnum.GENERIC_F103C6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103C6TX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103C6TX.build.board=GENERIC_F103C6TX
GenF1.menu.pnum.GENERIC_F103C6TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C6TX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)

# Generic F103C6Ux
GenF1.menu.pnum.GENERIC_F103C6UX=Generic F103C6Ux
GenF1.menu.pnum.GENERIC_F103C6UX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103C6UX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103C6UX.build.board=GENERIC_F103C6UX
GenF1.menu.pnum.GENERIC_F103C6UX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103C6UX.build.variant=STM32F1xx/F103C4T_F103C6(T-U)

# Generic F103C8Tx
GenF1.menu.pnum.GENERIC_F103C8TX=Generic F103C8Tx
GenF1.menu.pnum.GENERIC_F103C8TX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F103C8TX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103C8TX.build.board=GENERIC_F103C8TX
GenF1.menu.pnum.GENERIC_F103C8TX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103C8TX.build.variant=STM32F1xx/F103C8T_F103CB(T-U)

# Generic F103CBTx
GenF1.menu.pnum.GENERIC_F103CBTX=Generic F103CBTx
GenF1.menu.pnum.GENERIC_F103CBTX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103CBTX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103CBTX.build.board=GENERIC_F103CBTX
GenF1.menu.pnum.GENERIC_F103CBTX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103CBTX.build.variant=STM32F1xx/F103C8T_F103CB(T-U)

# Generic F103CBUx
GenF1.menu.pnum.GENERIC_F103CBUX=Generic F103CBUx
GenF1.menu.pnum.GENERIC_F103CBUX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103CBUX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103CBUX.build.board=GENERIC_F103CBUX
GenF1.menu.pnum.GENERIC_F103CBUX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103CBUX.build.variant=STM32F1xx/F103C8T_F103CB(T-U)

# Generic F103R4Hx
GenF1.menu.pnum.GENERIC_F103R4HX=Generic F103R4Hx
GenF1.menu.pnum.GENERIC_F103R4HX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F103R4HX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F103R4HX.build.board=GENERIC_F103R4HX
GenF1.menu.pnum.GENERIC_F103R4HX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103R4HX.build.variant=STM32F1xx/F103R(4-6)H

# Generic F103R6Hx
GenF1.menu.pnum.GENERIC_F103R6HX=Generic F103R6Hx
GenF1.menu.pnum.GENERIC_F103R6HX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103R6HX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103R6HX.build.board=GENERIC_F103R6HX
GenF1.menu.pnum.GENERIC_F103R6HX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103R6HX.build.variant=STM32F1xx/F103R(4-6)H

# Generic F103R4Tx
GenF1.menu.pnum.GENERIC_F103R4TX=Generic F103R4Tx
GenF1.menu.pnum.GENERIC_F103R4TX.upload.maximum_size=16384
GenF1.menu.pnum.GENERIC_F103R4TX.upload.maximum_data_size=6144
GenF1.menu.pnum.GENERIC_F103R4TX.build.board=GENERIC_F103R4TX
GenF1.menu.pnum.GENERIC_F103R4TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103R4TX.build.variant=STM32F1xx/F103R(4-6)T

# Generic F103R6Tx
GenF1.menu.pnum.GENERIC_F103R6TX=Generic F103R6Tx
GenF1.menu.pnum.GENERIC_F103R6TX.upload.maximum_size=32768
GenF1.menu.pnum.GENERIC_F103R6TX.upload.maximum_data_size=10240
GenF1.menu.pnum.GENERIC_F103R6TX.build.board=GENERIC_F103R6TX
GenF1.menu.pnum.GENERIC_F103R6TX.build.product_line=STM32F103x6
GenF1.menu.pnum.GENERIC_F103R6TX.build.variant=STM32F1xx/F103R(4-6)T

# Generic F103R8Hx
GenF1.menu.pnum.GENERIC_F103R8HX=Generic F103R8Hx
GenF1.menu.pnum.GENERIC_F103R8HX.upload.maximum_size=65536
GenF1.menu.pnum.GENERIC_F103R8HX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103R8HX.build.board=GENERIC_F103R8HX
GenF1.menu.pnum.GENERIC_F103R8HX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103R8HX.build.variant=STM32F1xx/F103R(8-B)H

# Generic F103RBHx
GenF1.menu.pnum.GENERIC_F103RBHX=Generic F103RBHx
GenF1.menu.pnum.GENERIC_F103RBHX.upload.maximum_size=131072
GenF1.menu.pnum.GENERIC_F103RBHX.upload.maximum_data_size=20480
GenF1.menu.pnum.GENERIC_F103RBHX.build.board=GENERIC_F103RBHX
GenF1.menu.pnum.GENERIC_F103RBHX.build.product_line=STM32F103xB
GenF1.menu.pnum.GENERIC_F103RBHX.build.variant=STM32F1xx/F103R(8-B)H

