stm32duino/Arduino_Core_STM32/boards.txt
# Generic G071RBTx
GenG0.menu.pnum.GENERIC_G071RBTX=Generic G071RBTx
GenG0.menu.pnum.GENERIC_G071RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RBTX.build.board=GENERIC_G071RBTX
GenG0.menu.pnum.GENERIC_G071RBTX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RBTX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G071RBIx
GenG0.menu.pnum.GENERIC_G071RBIX=Generic G071RBIx
GenG0.menu.pnum.GENERIC_G071RBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RBIX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RBIX.build.board=GENERIC_G071RBIX
GenG0.menu.pnum.GENERIC_G071RBIX.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RBIX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G081RBIx
GenG0.menu.pnum.GENERIC_G081RBIX=Generic G081RBIx
GenG0.menu.pnum.GENERIC_G081RBIX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081RBIX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081RBIX.build.board=GENERIC_G081RBIX
GenG0.menu.pnum.GENERIC_G081RBIX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081RBIX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Generic G081RBTx
GenG0.menu.pnum.GENERIC_G081RBTX=Generic G081RBTx
GenG0.menu.pnum.GENERIC_G081RBTX.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G081RBTX.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G081RBTX.build.board=GENERIC_G081RBTX
GenG0.menu.pnum.GENERIC_G081RBTX.build.product_line=STM32G081xx
GenG0.menu.pnum.GENERIC_G081RBTX.build.variant=STM32G0xx/G071R(6-8)T_G071RB(I-T)_G081RB(I-T)

# Upload menu
GenG0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG0.menu.upload_method.swdMethod.upload.protocol=0
GenG0.menu.upload_method.swdMethod.upload.options=-g
GenG0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG0.menu.upload_method.serialMethod.upload.protocol=1
GenG0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenG0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG0.menu.upload_method.dfuMethod.upload.protocol=2
GenG0.menu.upload_method.dfuMethod.upload.options=-g
GenG0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

###############################
# Generic G4
GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX=Generic G431C6Ux
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C6UX.build.board=GENERIC_G431C6UX
GenG4.menu.pnum.GENERIC_G431C6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C6UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

# Generic G431C8Ux
GenG4.menu.pnum.GENERIC_G431C8UX=Generic G431C8Ux
GenG4.menu.pnum.GENERIC_G431C8UX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431C8UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431C8UX.build.board=GENERIC_G431C8UX
GenG4.menu.pnum.GENERIC_G431C8UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431C8UX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

# Generic G431CBUx
GenG4.menu.pnum.GENERIC_G431CBUX=Generic G431CBUx
GenG4.menu.pnum.GENERIC_G431CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431CBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431CBUX.build.board=GENERIC_G431CBUX
GenG4.menu.pnum.GENERIC_G431CBUX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431CBUX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

# Generic G431K6Tx
GenG4.menu.pnum.GENERIC_G431K6TX=Generic G431K6Tx
GenG4.menu.pnum.GENERIC_G431K6TX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431K6TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K6TX.build.board=GENERIC_G431K6TX
GenG4.menu.pnum.GENERIC_G431K6TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K6TX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K8Tx
GenG4.menu.pnum.GENERIC_G431K8TX=Generic G431K8Tx
GenG4.menu.pnum.GENERIC_G431K8TX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431K8TX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K8TX.build.board=GENERIC_G431K8TX
GenG4.menu.pnum.GENERIC_G431K8TX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K8TX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431KBTx
GenG4.menu.pnum.GENERIC_G431KBTX=Generic G431KBTx
GenG4.menu.pnum.GENERIC_G431KBTX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KBTX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KBTX.build.board=GENERIC_G431KBTX
GenG4.menu.pnum.GENERIC_G431KBTX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KBTX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K6Ux
GenG4.menu.pnum.GENERIC_G431K6UX=Generic G431K6Ux
GenG4.menu.pnum.GENERIC_G431K6UX.upload.maximum_size=32768
GenG4.menu.pnum.GENERIC_G431K6UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K6UX.build.board=GENERIC_G431K6UX
GenG4.menu.pnum.GENERIC_G431K6UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K6UX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431K8Ux
GenG4.menu.pnum.GENERIC_G431K8UX=Generic G431K8Ux
GenG4.menu.pnum.GENERIC_G431K8UX.upload.maximum_size=65536
GenG4.menu.pnum.GENERIC_G431K8UX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431K8UX.build.board=GENERIC_G431K8UX
GenG4.menu.pnum.GENERIC_G431K8UX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431K8UX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G431KBUx
GenG4.menu.pnum.GENERIC_G431KBUX=Generic G431KBUx
GenG4.menu.pnum.GENERIC_G431KBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KBUX.build.board=GENERIC_G431KBUX
GenG4.menu.pnum.GENERIC_G431KBUX.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KBUX.build.variant=STM32G4xx/G431K(6-8-B)(T-U)_G441KB(T-U)

# Generic G441CBUx
GenG4.menu.pnum.GENERIC_G441CBUX=Generic G441CBUx
GenG4.menu.pnum.GENERIC_G441CBUX.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G441CBUX.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G441CBUX.build.board=GENERIC_G441CBUX
GenG4.menu.pnum.GENERIC_G441CBUX.build.product_line=STM32G441xx
GenG4.menu.pnum.GENERIC_G441CBUX.build.variant=STM32G4xx/G431C(6-8-B)U_G441CBU

